[{"title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars", "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "All About the Laser (and Microphone) Atop Mars 2020, NASA's Next Rover", "preview": "SuperCam is a rock-vaporizing instrument that will help scientists hunt for Mars fossils."}, {"title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch", "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."}, {"title": "NASA's Perseverance Rover Will Peer Beneath Mars' Surface ", "preview": "The agency's newest rover will use the first ground-penetrating radar instrument on the Martian surface to help search for signs of past microbial life. "}, {"title": "NASA Readies Perseverance Mars Rover's Earthly Twin ", "preview": "Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."}, {"title": "The Detective Aboard NASA's Perseverance Rover", "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."}, {"title": "Naming a NASA Mars Rover Can Change Your Life", "preview": "Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking."}, {"title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover", "preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "}, {"title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "preview": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"title": "NASA's Curiosity Keeps Rolling As Team Operates Rover From Home", "preview": "The team has learned to meet new challenges as they work remotely on the Mars mission."}, {"title": "NASA's Curiosity Mars Rover Snaps Its Highest-Resolution Panorama Yet", "preview": "To go along with the stunning 1.8-billion-pixel image, a new video offers a sweeping view of the Red Planet."}, {"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "}]